IDENTIFICATION DIVISION.
PROGRAM-ID. PRINT-1-TO-100.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 I PIC 999.
       PROCEDURE DIVISION.
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > 100
               DISPLAY I
           END-PERFORM
           STOP RUN.
